{
  "id": "product_195",
  "title": "3D Moving Sand Mountain Lamp With Stand - Sandscape Painting - Moving Sand Art - Showpiece - Home Decoration ( Random Color)",
  "description": "Description\r\n3D Moving Sand Mountain Lamp With Stand - Sandscape Painting - Moving Sand Art - Showpiece - Home Decoration ( Random Color)\r\n\r\nIntroducing the Sandscape Lamp - a unique and mesmerizing piece of home decor that is sure to catch the eye of anyone who enters your space. This 3D moving sand mountain lamp is designed to create a calming and soothing effect, making it the perfect addition to any room. The metal stand and sand clock are built with heavy-duty materials, ensuring that this lamp will last for years to come. The beautiful design adds a touch of elegance to your home, making it a great conversation starter.This product is perfect who likes aesthetic look over of room and one of the best product of aesthetic room decor. The Sandscape Lamp is not only perfect for calming your mind after a long day, but it also adds a beautiful look to your space. The sand mountain moves slowly and continuously, creating a mesmerizing effect that will leave you feeling relaxed and at peace. The lamp is designed to be energy-efficient, so you can enjoy its calming effect without worrying about your electricity bill. This lamp is an excellent gift for anyone who loves unique and interesting home decor. With its calming effect and stunning design, this lamp is sure to become a favorite in your home, providing a peaceful ambiance that you can enjoy every day. The Sandscape Lamp is perfect for use in your bedroom, living room, or any other space where you want to create a relaxing atmosphere. In summary, the Sandscape Lamp is a high-quality, durable, and energy-efficient lamp that is designed to create a calming and soothing effect in any room. Its stunning design and unique features make it an excellent addition to any home, and it is sure to become a conversation starter among your guests. Whether you want to use it for relaxation or as a beautiful piece of home decor, the Sandscape Lamp is the perfect choice.\r\n\r\nRandom Color",
  "availability": "in stock",
  "condition": "new",
  "price": 1299,
  "link": "",
  "image_link1": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/06/ad74cadef553c57ea3585d80b8f738a2.jpg",
  "image_link2": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/06/8bce104a74cac41cfdc848d87ab9875e.jpg",
  "image_link3": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/06/ab806fd697f3664e9be116660d581af9.jpg",
  "image_link4": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/06/a5bada47120776ab15944008175b5169.jpg",
  "image_link5": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2025/10/06/9e9e60b99699727f17e73fb58c3d657f.jpeg",
  "image_link6": "",
  "image_link7": "",
  "image_link8": "",
  "image_link9": "",
  "image_link10": "",
  "image_link11": "",
  "image_link12": "",
  "image_link13": "",
  "image_link14": "",
  "image_link15": "",
  "category": "TVs & Home Appliances",
  "subcategory": "Home_Appliances",
  "product_tags": "Women's_Clothing",
  "product_url": "products/product_195/3d-moving-sand-mountain-lamp-with-stand-sandscape-painting-moving-sand-art-showpiece-home-decoration-random-color.json",
  "category_url": "categories/tvs-home-appliances.json",
  "subcategory_url": "categories/tvs-home-appliances/home-appliances.json"
}