{
  "id": "product_252",
  "title": "36 / 8 hole bazooka bubble Water gun | Bazooka Water Bubble Gun Toy for Kids, toddlers | Out door Fun Water Spray Gun (Random color)",
  "description": "This Bazooka Bubble Gun Toy is the perfect way to add some fun to playtime! With its bubble-blowing feature, your child can create endless bubbles for hours of entertainment. The lightweight design makes it easy for little hands to handle. Let your child's imagination run wild with this exciting toy!\r\n?High Quality Materials] The Bubble Machine made of high-quality non-toxic and skin safe ABS plastic is selected in the material, which is 100% safe and durable, burr free, BPA and lead free. Passed the US toy standard CPSIA & ASTM test. No harm to toddlers, children, pets and adults. ?Popular Rocket Boom Bubble Machine?: Our bubble blower has been tested and adjusted many times by toy engineers. Ergonomic non-slip grips are used in the structure, suitable for hands of all ages. It?s a perfect prop for a photo, you can take perfect photos and videos with it. ?Most Popular Bubble Toys?: This Bubble Maker is a perfect gift for kids & friends, suitable for various party occasions, such as birthday parties, wedding, graduation, camping trips, beaches, backyard bubble parties, etc. ?Warm Tips? 1)Please use a special bubble solution not DIY soap, the former can create a lot of bubbles, it?s very important because with soap is not the same effect. 2) Please charged at least 2-3 hours to full before use. 3) Don?t stick too much bubble solution, it avoids bubbles sticking together, just only stick little solutions, it can blow thousands of bubble from machine outlet.Elevate bubble-blasting fun with the Bubble Rechargeable Machine Blaster Gun, featuring 36 holes and captivating lights for an enchanting experience.With its rechargeable design, this gun ensures long-lasting entertainment without the hassle of batteries.Material: PlasticBattery operated (4 AA Batteries) - (Not Included in the package)",
  "availability": "in stock",
  "condition": "new",
  "price": 920,
  "link": "",
  "image_link1": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/07/bazooka-bubble-machine-gun-32-holes-185337_400x_550c3c7b-9fec-47fc-9adf-a64f304488be_400x400-1.jpg",
  "image_link2": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/07/WhatsApp-Image-2024-07-09-at-10.58.27-PM.jpeg",
  "image_link3": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/07/WhatsApp-Image-2024-07-10-at-2.48.08-AM.jpeg",
  "image_link4": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/07/WhatsApp-Image-2024-07-10-at-2.48.09-AM.jpeg",
  "image_link5": "",
  "image_link6": "",
  "image_link7": "",
  "image_link8": "",
  "image_link9": "",
  "image_link10": "",
  "image_link11": "",
  "image_link12": "",
  "image_link13": "",
  "image_link14": "",
  "image_link15": "",
  "category": "Kids & Toys",
  "subcategory": "Toys",
  "product_tags": "Women's_Clothing",
  "product_url": "products/product_252/36-8-hole-bazooka-bubble-water-gun-bazooka-water-bubble-gun-toy-for-kids-toddlers-out-door-fun-water-spray-gun-random-color.json",
  "category_url": "categories/kids-toys.json",
  "subcategory_url": "categories/kids-toys/toys.json"
}