{
  "id": "product_254",
  "title": "Hover Ball with Lights Air Floating Soccer Toy with LED Lights and Foam Bumper, Indoor Games for Kids",
  "description": "Hello kids !! I am a hover ball toy . Let me explain you how to play with me . As you insert AA batteries there will be vaccume pressure from downwards and when you put it on the ground it floats . Kick the hover ball and it will come back after getting hitted by wall or person.\r\nThis hover football can be used in outdoor gardens, parks, open spaces or indoor floors, thin carpets, or basements. In addition, the lighter weight helps the floating ball float better in the air and can effectively avoid obstacles on the ground Super Soft Bumper: This float football has super soft foam bumpers that can protect your furniture and walls from scratches and also protects the child?s feet from injury Colorful LED Lights: This hover football has beautiful multi-color LED lights, which can greatly attract children's attention and make night games more cool Convenient Sports: This hover football toy allows your child to kill time in inclement weather. Have fun even indoors! Circling football can make children exercise fully, allowing them to enjoy sports anytime, anywhere. This is more conducive to training children's brain response ability and hand-foot coordination Perfect Gift: This hover football is very suitable as a birthday holiday gift for children aged 3-12. Whether it is parent-child interaction or children playing independently, it can bring a lot of fun",
  "availability": "in stock",
  "condition": "new",
  "price": 1190,
  "link": "",
  "image_link1": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/01/4fc5ed34a56f1e747496a2ae7b303330.jpg_750x750.jpg_.webp",
  "image_link2": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/01/80e2044d2fecb058f2a88cf6fb400af4.jpg_750x750.jpg_.webp",
  "image_link3": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/05/WhatsApp-Image-2024-05-12-at-3.08.47-PM.jpeg",
  "image_link4": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/05/WhatsApp-Image-2024-05-12-at-3.07.46-PM.jpeg",
  "image_link5": "",
  "image_link6": "",
  "image_link7": "",
  "image_link8": "",
  "image_link9": "",
  "image_link10": "",
  "image_link11": "",
  "image_link12": "",
  "image_link13": "",
  "image_link14": "",
  "image_link15": "",
  "category": "Kids & Toys",
  "subcategory": "Toys",
  "product_tags": "Women's_Clothing",
  "product_url": "products/product_254/hover-ball-with-lights-air-floating-soccer-toy-with-led-lights-and-foam-bumper-indoor-games-for-kids.json",
  "category_url": "categories/kids-toys.json",
  "subcategory_url": "categories/kids-toys/toys.json"
}