{
  "id": "product_274",
  "title": "Cnaier 4 in 1 Electric Cleanser | Facial Cleansing Brush & Massager - Face Brush Set | Electric Rotating Face Scrubber for Deep Cleaning, Exfoliating, Blackhead Removing AE-8286",
  "description": "Two cleaning speeds. High speed: normal skin or skin with thick stratum corneum. Low speed: sensitive skin.2. With IP65 waterproof design, don't worry about using it in the bathroom or shower.3. Use USB to charge.4. Sponge brush head: easily remove oil and dirt on the skin surface5. Ultra-fine soft brush head: exfoliates dead skin cells6. Massage brush head: reduce edema, improve fine lines and increase skin elasticityPackage:Electric cleansing brush x1Sponge brush head x1Superfine soft brush head x2MULTI-FUNCTION BRUSH HEAD: This facial cleaning machine uses 3D sonic motion to deepen the cleansing and better promote collagen production. Equipped with 4 brush head: 1 sponge pad to easily remove dirt and dirt on the surface; 2 ultra-fine soft facial brushes for replacement and full exfoliation, remove grease and dead skin; 1 acupressure massage rolling head to lose weight, reduce edema and Wrinkles, increase skin elasticity, greatly contribute to the nutritional absorption of beauty cream.? EXTRA CLEAN SKIN: This NEWEST 3D sonic electric cleansing brush uses the most advanced and innovative ion cleaning technology. It effectively exfoliates, cleans and removes dead cells, blackheads, acne and dust particles in clogged pores. In addition, it can increase?Massage brush head x1USB charging cable x1Cleansing brush base x1Rechargeable",
  "availability": "in stock",
  "condition": "new",
  "price": 3199,
  "link": "",
  "image_link1": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/05/2-2.webp",
  "image_link2": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/05/5.webp",
  "image_link3": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/05/4.webp",
  "image_link4": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/05/3-1.webp",
  "image_link5": "",
  "image_link6": "",
  "image_link7": "",
  "image_link8": "",
  "image_link9": "",
  "image_link10": "",
  "image_link11": "",
  "image_link12": "",
  "image_link13": "",
  "image_link14": "",
  "image_link15": "",
  "category": "Health & Beauty",
  "subcategory": "Personal_Care",
  "product_tags": "Women's_Clothing",
  "product_url": "products/product_274/cnaier-4-in-1-electric-cleanser-facial-cleansing-brush-massager-face-brush-set-electric-rotating-face-scrubber-for-deep-cleaning-exfoliating-blackhead-removing-ae-8286.json",
  "category_url": "categories/health-beauty.json",
  "subcategory_url": "categories/health-beauty/personal-care.json"
}