{
  "id": "product_259",
  "title": "Washing Machine Cleaning Tablets - 12 Tablets Pack",
  "description": "Developed to ensure thorough cleaning of your washing machine. Cleans the filter & internal parts of your appliance including the drum & pipes.Use these cleaning tablets to keep your machine and pipes clean and free of these deposits. Get the ultimate cleaning experience with precision cleaning.Designed to penetrate, dissolve, and remove odor-causing residue that can occur in all washing machines.Simply place 1 tablet into the drum and proceed with a wash cycle.Suitable for use with all Washing Machines. Safe to use with Front Load Washing Machines and Top Load Washing Machines - High Efficiency (HE) and Conventional Washers.For best results use 1 tablet each month. Keep your machine fresher and cleaner.\r\nKills bacteria\r\nThis Washing Machine Cleaner kills by 99% of the bacteria and other pathogens in 20 minutes, with a dilution ratio of 1:100 of product to water.\r\nWorking principle\r\nIt works by penetrating, dissolving, and removing residues, mold, and bacteria to keep them from causing laundry problems down the road. Say goodbye to unseen germs on your freshly cleaned clothes.\r\nFeatures\r\nEliminates nasty residue build up in the pipes and crevices of your washing machine. Removes nasty odors by breaking down the source of the problem.Rapid infiltration disintegration of dirt. Decontamination with reactive oxygen species to reduce moldy taste.Inhibits 99% of bacteria in the laundry. Keep your whole family away from bacteria and make your machine work like brand new.Washing machine cleaning expert, decontamination effervescent tablets. Refusal of secondary contamination of clothesEnhance the washing efficiency without damaging the washing machine.\r\nSpecifications\r\nMaterial: Reactive substances.Packaging: opp bags.Package Include:12 pcs washing machine cleaning tablet",
  "availability": "in stock",
  "condition": "new",
  "price": 290,
  "link": "",
  "image_link1": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2023/07/6-1.webp",
  "image_link2": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2023/07/5-1.webp",
  "image_link3": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2023/07/4-1.webp",
  "image_link4": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2023/07/3-1.webp",
  "image_link5": "https://hhcnewapp.blr1.digitaloceanspaces.com/uploads/2024/08/WhatsApp-Image-2024-08-03-at-2.17.27-PM.jpeg",
  "image_link6": "",
  "image_link7": "",
  "image_link8": "",
  "image_link9": "",
  "image_link10": "",
  "image_link11": "",
  "image_link12": "",
  "image_link13": "",
  "image_link14": "",
  "image_link15": "",
  "category": "TVs & Home Appliances",
  "subcategory": "Home_Appliances",
  "product_tags": "Women's_Clothing",
  "product_url": "products/product_259/washing-machine-cleaning-tablets-12-tablets-pack.json",
  "category_url": "categories/tvs-home-appliances.json",
  "subcategory_url": "categories/tvs-home-appliances/home-appliances.json"
}